
{
    "recipes": [
      {
        "id": 1,
        "name": "Pasta Carbonara",
        "ingredients": ["spaghetti", "bacon", "eggs", "parmesan cheese", "black pepper"],
        "instructions": "1. Cook spaghetti according to package instructions. 2. In a separate pan, cook bacon until crispy. 3. In a bowl, whisk together eggs and parmesan cheese. 4. Drain spaghetti and add to the pan with bacon. 5. Pour egg mixture over spaghetti and toss until coated. 6. Season with black pepper and serve immediately.",
        "image": "assets/recipe1.jpg"
      },
      {
        "id": 2,
        "name": "Chicken Alfredo",
        "ingredients": ["chicken breast", "fettuccine", "heavy cream", "butter", "garlic", "parmesan cheese"],
        "instructions": "1. Cook fettuccine according to package instructions. 2. Season chicken breast with salt and pepper, then cook until golden brown. 3. In a separate pan, melt butter and sauté garlic until fragrant. 4. Pour in heavy cream and bring to a simmer. 5. Stir in parmesan cheese until melted and smooth. 6. Add cooked pasta to the sauce, then top with sliced chicken breast. 7. Serve hot.",
        "image": "https://example.com/chicken_alfredo.jpg"
      },
      {
        "id": 3,
        "name": "Caprese Salad",
        "ingredients": ["tomatoes", "fresh mozzarella cheese", "fresh basil leaves", "balsamic vinegar", "olive oil", "salt", "black pepper"],
        "instructions": "1. Slice tomatoes and fresh mozzarella cheese into thin slices. 2. Arrange tomato and mozzarella slices on a plate, alternating them. 3. Tuck fresh basil leaves between tomato and mozzarella slices. 4. Drizzle with balsamic vinegar and olive oil. 5. Season with salt and black pepper to taste. 6. Serve immediately.",
        "image": "https://example.com/caprese_salad.jpg"
      },
      {
        "id": 4,
        "name": "Chocolate Chip Cookies",
        "ingredients": ["all-purpose flour", "butter", "brown sugar", "granulated sugar", "vanilla extract", "baking soda", "salt", "chocolate chips"],
        "instructions": "1. Preheat oven to 350°F (175°C) and line a baking sheet with parchment paper. 2. In a bowl, cream together butter, brown sugar, and granulated sugar until light and fluffy. 3. Beat in vanilla extract and eggs until well combined. 4. In a separate bowl, whisk together flour, baking soda, and salt. 5. Gradually add dry ingredients to the wet ingredients and mix until dough forms. 6. Stir in chocolate chips. 7. Drop tablespoon-sized balls of dough onto the prepared baking sheet. 8. Bake for 8-10 minutes, or until edges are golden brown. 9. Allow cookies to cool on the baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
        "image": "https://example.com/chocolate_chip_cookies.jpg"
      },
      {
        "id": 5,
        "name": "Vegetable Stir-Fry",
        "ingredients": ["mixed vegetables (e.g., bell peppers, broccoli, carrots)", "tofu", "soy sauce", "sesame oil", "garlic", "ginger", "cornstarch", "vegetable broth", "rice"],
        "instructions": "1. Cook rice according to package instructions and set aside. 2. Press tofu to remove excess moisture, then cut into cubes. 3. In a wok or large skillet, heat sesame oil over medium heat. 4. Add tofu cubes and cook until golden brown on all sides. Remove from the pan and set aside. 5. In the same pan, add a bit more oil if needed, then stir-fry garlic and ginger until fragrant. 6. Add mixed vegetables to the pan and cook until tender-crisp. 7. In a small bowl, whisk together soy sauce, cornstarch, and vegetable broth. 8. Pour the sauce over the vegetables and cook until thickened. 9. Add cooked tofu back to the pan and toss to combine. 10. Serve hot over cooked rice.",
        "image": "https://example.com/vegetable_stir_fry.jpg"
      },
      {
        "id": 6,
        "name": "Margherita Pizza",
        "ingredients": ["pizza dough", "tomato sauce", "fresh mozzarella cheese", "fresh basil leaves", "olive oil", "salt", "black pepper"],
        "instructions": "1. Preheat oven to 475°F (245°C). 2. Roll out pizza dough on a floured surface to desired thickness. 3. Transfer dough to a pizza stone or baking sheet. 4. Spread tomato sauce evenly over the dough. 5. Tear fresh mozzarella cheese into small pieces and scatter over the sauce. 6. Arrange fresh basil leaves on top of the cheese. 7. Drizzle with olive oil and season with salt and black pepper. 8. Bake for 10-15 minutes, or until crust is golden brown and cheese is bubbly. 9. Slice and serve hot.",
        "image": "https://example.com/margherita_pizza.jpg"
      },
      {
        "id": 7,
        "name": "Caesar Salad",
        "ingredients": ["romaine lettuce", "croutons", "parmesan cheese", "caesar dressing", "lemon", "garlic", "olive oil", "salt", "black pepper"],
        "instructions": "1. Wash and chop romaine lettuce into bite-sized pieces. 2. In a bowl, combine chopped lettuce with croutons and grated parmesan cheese. 3. In a separate bowl, whisk together caesar dressing, lemon juice, minced garlic, olive oil, salt, and black pepper. 4. Pour dressing over the salad and toss until evenly coated. 5. Serve immediately.",
        "image": "https://example.com/caesar_salad.jpg"
      },
      {
        "id": 8,
        "name": "Tiramisu",
        "ingredients": ["ladyfingers", "espresso", "mascarpone cheese", "whipping cream", "sugar", "cocoa powder"],
        "instructions": "1. Brew espresso and let it cool. 2. In a bowl, beat whipping cream until stiff peaks form. 3. In a separate bowl, mix mascarpone cheese with sugar until smooth. 4. Gently fold whipped cream into the mascarpone mixture until combined. 5. Dip ladyfingers into the cooled espresso and arrange them in a single layer in a serving dish. 6. Spread half of the mascarpone mixture over the ladyfingers. 7. Repeat layers with remaining ladyfingers and mascarpone mixture. 8. Dust the top layer with cocoa powder. 9. Refrigerate for at least 4 hours before serving.",
        "image": "https://example.com/tiramisu.jpg"
      },
      {
        "id": 9,
        "name": "Hawaiian Pizza",
        "ingredients": ["pizza dough", "tomato sauce", "ham", "pineapple", "mozzarella cheese"],
        "instructions": "1. Preheat oven to 475°F (245°C). 2. Roll out pizza dough on a floured surface to desired thickness. 3. Transfer dough to a pizza stone or baking sheet. 4. Spread tomato sauce evenly over the dough. 5. Top with ham and pineapple chunks. 6. Sprinkle mozzarella cheese over the toppings. 7. Bake for 10-15 minutes, or until crust is golden brown and cheese is bubbly. 8. Slice and serve hot.",
        "image": "https://example.com/hawaiian_pizza.jpg"
      },
      {
        "id": 10,
        "name": "Mango Salsa",
        "ingredients": ["ripe mango", "red bell pepper", "red onion", "jalapeno pepper", "cilantro", "lime juice", "salt"],
        "instructions": "1. Dice ripe mango, red bell pepper, red onion, and jalapeno pepper. 2. Finely chop cilantro. 3. In a bowl, combine diced mango, bell pepper, onion, jalapeno, and cilantro. 4. Squeeze lime juice over the mixture and sprinkle with salt. 5. Stir until well combined. 6. Serve with tortilla chips or as a topping for grilled fish or chicken.",
        "image": "https://example.com/mango_salsa.jpg"
      },
      {
        "id": 11,
        "name": "Eggplant Parmesan",
        "ingredients": ["eggplant", "breadcrumbs", "parmesan cheese", "mozzarella cheese", "tomato sauce", "olive oil", "salt", "black pepper"],
        "instructions": "1. Preheat oven to 375°F (190°C). 2. Slice eggplant into 1/2-inch thick rounds. 3. In one bowl, whisk eggs. In another bowl, combine breadcrumbs with grated parmesan cheese. 4. Dip eggplant slices into the egg mixture, then coat with breadcrumb mixture. 5. Heat olive oil in a skillet over medium heat. Fry eggplant slices until golden brown on both sides. 6. Spread a thin layer of tomato sauce on the bottom of a baking dish. 7. Arrange fried eggplant slices in the dish, overlapping slightly. 8. Top with more tomato sauce and shredded mozzarella cheese. 9. Repeat layers until all ingredients are used, finishing with a layer of cheese. 10. Bake for 25-30 minutes, or until cheese is melted and bubbly. 11. Serve hot, garnished with fresh basil if desired.",
        "image": "https://example.com/eggplant_parmesan.jpg"
      },
      {
        "id": 12,
        "name": "Greek Salad",
        "ingredients": ["cucumbers", "tomatoes", "red onion", "kalamata olives", "feta cheese", "olive oil", "red wine vinegar", "dried oregano", "salt", "black pepper"],
        "instructions": "1. Chop cucumbers, tomatoes, and red onion into bite-sized pieces. 2. Pit and halve kalamata olives. 3. Crumble feta cheese. 4. In a large bowl, combine chopped vegetables, olives, and feta cheese. 5. In a small bowl, whisk together olive oil, red wine vinegar, dried oregano, salt, and black pepper to make the dressing. 6. Pour dressing over the salad and toss until evenly coated. 7. Serve immediately.",
        "image": "https://example.com/greek_salad.jpg"
      },
      {
        "id": 13,
        "name": "Beef Tacos",
        "ingredients": ["ground beef", "taco seasoning", "tortillas", "shredded lettuce", "diced tomatoes", "shredded cheese", "sour cream", "salsa", "avocado", "lime wedges"],
        "instructions": "1. In a skillet over medium heat, cook ground beef until browned. 2. Drain excess fat and stir in taco seasoning. 3. Warm tortillas according to package instructions. 4. Fill each tortilla with cooked ground beef, shredded lettuce, diced tomatoes, shredded cheese, sour cream, salsa, and sliced avocado. 5. Squeeze lime wedges over tacos before serving. 6. Serve hot.",
        "image": "https://example.com/beef_tacos.jpg"
      },
      {
        "id": 14,
        "name": "Spaghetti Bolognese",
        "ingredients": ["spaghetti", "ground beef", "onion", "garlic", "carrot", "celery", "crushed tomatoes", "tomato paste", "red wine", "beef broth", "bay leaf", "dried oregano", "salt", "black pepper", "parmesan cheese"],
        "instructions": "1. Cook spaghetti according to package instructions. 2. In a large skillet, cook ground beef until browned. 3. Add chopped onion, minced garlic, diced carrot, and diced celery to the skillet. Cook until vegetables are softened. 4. Stir in crushed tomatoes, tomato paste, red wine, beef broth, bay leaf, dried oregano, salt, and black pepper. 5. Simmer for 20-30 minutes, stirring occasionally. 6. Remove bay leaf before serving. 7. Serve hot over cooked spaghetti, garnished with grated parmesan cheese.",
        "image": "https://example.com/spaghetti_bolognese.jpg"
      },
      {
        "id": 15,
        "name": "Berry Smoothie",
        "ingredients": ["mixed berries (e.g., strawberries, blueberries, raspberries)", "banana", "yogurt", "milk", "honey", "ice cubes"],
        "instructions": "1. In a blender, combine mixed berries, banana, yogurt, milk, honey, and ice cubes. 2. Blend until smooth and creamy. 3. Taste and adjust sweetness if needed by adding more honey. 4. Pour into glasses and serve immediately.",
        "image": "https://example.com/berry_smoothie.jpg"
      }
    ]
  }
  